toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <cstdint>
#include <cstdbool>
#include <cstddef>
#include <atomic>
#include <ratio>
#include "Code/Lib/Toastbox/Scheduler.h"
#include "Code/Lib/Toastbox/Util.h"
#include "Code/Shared/SDCard.h"
#include "Code/Shared/ICE.h"
#include "Code/Shared/ImgSensor.h"
#include "Code/Shared/ImgAutoExposure.h"
#include "Code/Shared/Assert.h"
#include "Code/Shared/MSP.h"
#include "Code/Shared/ImgSD.h"
#include "Code/Shared/Time.h"
#include "Code/Shared/TimeConstants.h"
#include "Code/Shared/MSPTriggers.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "Watchdog.h"
#include "SysTick.h"
#include "RegLocker.h"
#include "I2C.h"
#include "BatterySampler.h"
#include "Button.h"
#include "AssertionCounter.h"
#include "Motion.h"
#include "Timer.h"
#include "Debug.h"
#include "WiredMonitor.h"
#include "System.h"
#include "Property.h"
#include "LED.h"
using namespace GPIO;

using _Clock = T_Clock<_Scheduler, _MCLKFreqHz, _Pin::MSP_XIN, _Pin::MSP_XOUT>;
using _SysTick = T_SysTick<_Scheduler, _ACLKFreqHz>;
using _SPI = T_SPI<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;
using _ICE = T_ICE<_Scheduler>;

using _I2C = T_I2C<_Scheduler, _Pin::MSP_STM_I2C_SCL, _Pin::MSP_STM_I2C_SDA, MSP::I2CAddr>;
using _Motion = T_Motion<_Scheduler, _Pin::MOTION_EN_, _Pin::MOTION_SIGNAL>;

using _BatterySampler = T_BatterySampler<_Scheduler, _Pin::BAT_CHRG_LVL, _Pin::BAT_CHRG_LVL_EN>;

using _Button = T_Button<_Scheduler, _Pin::BUTTON_SIGNAL_>;

using _WiredMonitor = T_WiredMonitor<_Pin::VDD_B_3V3_STM>;

static constexpr uint32_t _FlickerSlowPeriodMs = 5000;
static constexpr uint32_t _FlickerOnDurationMs = 20;
static constexpr uint32_t _FlickerFastPeriodMs = 100;
using _LED = T_LED<
    _Scheduler,
    _Pin::LED_SEL,
    _Pin::LED_SIGNAL,
    _ACLKFreqHz,
    _FlickerSlowPeriodMs,
    _FlickerOnDurationMs,
    _FlickerFastPeriodMs
>;

// _ImgSensor: image sensor object
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE                    // T_ICE
>;

// _SDCard: SD card object
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    6                   // T_ClkDelayFast (odd values invert the clock)
>;

// _RTC: real time clock
using _RTC = T_RTC<_Scheduler, _XT1FreqHz>;
using _Watchdog = T_Watchdog<_ACLKFreqHz, (Time::TicksU64)_RTC::InterruptIntervalTicks*2>;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in FRAM because it needs to persist indefinitely.
[[gnu::section(".persistent")]]
static MSP::State _State = {
    .header = MSP::StateHeader,
};

static void _EventsEnabledUpdate();
static void _EventsEnabledChanged();
static void _MotionPoweredUpdate();

// _TaskPowerStateSaved: remembers our power state across crashes and LPM3.5.
//
// This needs to be a global for the gnu::section attribute to work.
[[gnu::section(".ram_backup_bss._TaskPowerStateSaved")]]
static inline uint8_t _TaskPowerStateSaved = 0;

// _EventsEnabled: whether _TaskEvent should be running and handling events
static T_Property<bool,_EventsEnabledChanged,_MotionPoweredUpdate> _EventsEnabled;

// _MotionPowered: whether the motion sensor should have power applied
struct _MotionPowered : T_AssertionCounter<_MotionPoweredUpdate> {};

// _Triggers: stores our current event state
using _Triggers = T_MSPTriggers<_State, _MotionPowered::Assertion>;

[[gnu::noinline]]
static constexpr Time::Instant _TimeInstantAdd(const Time::Instant& time, Time::TicksS32 deltaTicks) {
    return time + deltaTicks;
}

static constexpr Time::TicksU32 _TicksForMs(uint64_t ms) {
    return ((ms * Time::TicksPeriod::den) / (1000 * Time::TicksPeriod::num));
}

template<typename T_Dst, typename T_Src>
static T_Dst& _Cast(T_Src& x) {
    return static_cast<T_Dst&>(x);
}

// MARK: - Reset

[[noreturn]]
static void _BOR() {
    PMMCTL0 = PMMPW | PMMSWBOR;
    // Wait for reset
    for (;;);
}

static void _ResetRecord(MSP::Reset::Type type, uint16_t ctx) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    Reset* hist = nullptr;
    for (Reset& h : _State.resets) {
        if (!h.count || (h.type==type && h.ctx.u16==ctx)) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
    // If this is the first occurrence of this kind of reset, fill out its fields.
    if (hist->count == 0) {
        hist->type = type;
        hist->ctx.u16 = ctx;
    }
    
    // Increment the count, but don't allow it to overflow
    if (hist->count < std::numeric_limits<decltype(hist->count)>::max()) {
        hist->count++;
    }
}

[[noreturn]]
static void _Reset(MSP::Reset::Type type, uint16_t ctx) {
    // Disable interrupts
    Toastbox::IntState::Set(false);
    // Record the abort
    _ResetRecord(type, ctx);
    // Wait until all prints have been drained, so we don't drop important
    // info by aborting before it's been read.
    while (!Debug::Empty());
    _BOR();
}

[[noreturn]]
void _SchedulerStackOverflow(size_t taskIdx) {
    _Reset(MSP::Reset::Type::StackOverflow, taskIdx);
}

// Abort(): called by Assert() with the address that aborted
extern "C"
[[noreturn, gnu::used]]
void Abort(uintptr_t addr) {
    _Reset(MSP::Reset::Type::Abort, addr);
}

extern "C"
[[noreturn]]
void abort() {
    Assert(false);
}

extern "C"
int atexit(void (*)(void)) {
    return 0;
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    _SPI::WriteRead(msg, resp);
}

static void _ICEInit() {
    bool ok = false;
    for (int i=0; i<100 && !ok; i++) {
        _Scheduler::Sleep(_Scheduler::Ms<1>);
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        ok = _ICE::Init();
    }
    Assert(ok);
}





// MARK: - _TaskLED

struct _TaskLED {
    using Priority = uint8_t;
    static constexpr Priority PriorityButton        = 0;
    static constexpr Priority PriorityBatteryTrap   = 1;
    static constexpr Priority PriorityHostMode      = 2;
    static constexpr Priority PriorityChargeState   = 3;
    static constexpr Priority _PriorityCount        = 4;
    
