toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // Start tasks
        _Scheduler::Start<_TaskI2C, _TaskMotion, _TaskButton, _TaskLED>();
        
        // Restore our saved power state
        // This is necessary so that we return to our previous state after an abort.
        _State = _TaskPowerStateSaved;
        
        // Trigger a battery level update when first starting
        BatteryLevelUpdate();
    }
    
    static void _StateChanged() {
        _TaskPowerStateSaved = _State;
    }
    
    static bool _On() {
        return _State & _StateOn;
    }
    
    static void _On(bool x) {
        // Short-circuit if our state didn't change
        if (x == _On()) return;
        if (x) _State = _State |  _StateOn;
        else   _State = _State & ~_StateOn;
    }
    
    static bool _Wired() {
        return _State & _StateWired;
    }
    
    static void _Wired(bool x) {
        // Short-circuit if our state didn't change
        if (x == _Wired()) return;
        
        uint8_t s = _State;
        if (x) {
            // Entering the Wired state
            // Turn ourself on
            s |= _StateOn | _StateWired;
        } else {
            // Exiting the Wired state
            // Exit the On state if we're in BatteryTrap
            if (_BatteryTrap()) s &= ~_StateOn;
            s &= ~_StateWired;
        }
        _State = s;
    }
    
    static void _BatteryLevelSet(MSP::BatteryLevelMv x) {
        // No short-circuit logic here because we need our first _BatteryLevel assignment
        // to cause us to enter battery trap via our logic below, if the battery level is
        // low enough.
        _BatteryLevel = x;
        
        // If our battery level drops below the Enter threshold, enter battery trap
        if (_BatteryLevel <= _BatteryTrapLevelEnter) {
            _BatteryTrap(true);
        
        // If our battery level raises above the Exit threshold, exit battery trap
        } else if (_BatteryLevel >= _BatteryTrapLevelExit) {
            _BatteryTrap(false);
        }
    }
    
    static bool _BatteryTrap() {
        return _State & _StateBatteryTrap;
    }
    
    static void _BatteryTrap(bool x) {
        // Short-circuit if our state didn't change
        if (x == _BatteryTrap()) return;
        
        uint8_t s = _State;
        if (x) {
            // Entering BatteryTrap
            // Turn ourself off if we're not wired
            if (!_Wired()) s &= ~_StateOn;
            s |= _StateBatteryTrap;
        } else {
            s &= ~_StateBatteryTrap;
        }
        _State = s;
    }
    
    static void _LEDFlickerEnabledUpdate() {
        _LEDFlickerEnabled = _BatteryTrap() && !_Wired();
    }
    
    static void _LEDFlickerEnabledChanged() {
        if (_LEDFlickerEnabled) {
            _TaskLED::Set(_TaskLED::PriorityBatteryTrap, _LED::StateRed | _LED::StateFlickerSlow);
        } else {
            _TaskLED::Set(_TaskLED::PriorityBatteryTrap, std::nullopt);
        }
    }
    
    static constexpr uint8_t _StateOff          = 0;
    static constexpr uint8_t _StateOn           = 1<<0;
    static constexpr uint8_t _StateBatteryTrap  = 1<<1;
    static constexpr uint8_t _StateWired        = 1<<2;
    
    static constexpr uint16_t _BatterySampleIntervalRTCDays = 4;
    static constexpr uint16_t _BatterySampleIntervalRTC     = (_BatterySampleIntervalRTCDays * Time::Day) / _RTC::InterruptIntervalTicks;
    static constexpr uint16_t _BatterySampleIntervalCapture = 512;
    static_assert(_BatterySampleIntervalRTC == 168);  // Debug
    
    // _BatteryTrapLevelEnter/_BatteryTrapLevelExit: these are the millivolt values corresponding
    // to the indicated battery percentages. These were calculated by linearizing the battery
    // discharge plot. (See battery discharge table in MDCStudio.)
    static constexpr MSP::BatteryLevelMv _BatteryTrapLevelEnter = 3321; // 2% battery
    static constexpr MSP::BatteryLevelMv _BatteryTrapLevelExit  = 3681; // 10% battery
    
    static inline uint16_t _RTCCounter = 0;
    static inline uint16_t _CaptureCounter = 0;
    
    static inline MSP::BatteryLevelMv _BatteryLevel = MSP::BatteryLevelMvInvalid;
    static inline bool _BatteryLevelUpdate = false;
    
    // _State: our current power state
    // Left uninitialized because we always initialize it with _TaskPowerStateSaved
    static inline T_Property<uint8_t,_StateChanged,_EventsEnabledUpdate,_LEDFlickerEnabledUpdate,_MotionPoweredUpdate> _State;
    
    // _LEDFlickerEnabled: whether the LED should flicker periodically (due to battery trap)
    static inline T_Property<bool,_LEDFlickerEnabledChanged> _LEDFlickerEnabled;
    
    // Task stack
    static constexpr auto& Stack = _TaskPowerStack;
};

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until STM is up (ie we're plugged in)
            _Scheduler::Wait([] { return _WiredMonitor::Wired(); });
            
            _I2C::Init();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            _Scheduler::Sleep(_Scheduler::Ms<10>);
            
            if (!_WiredMonitor::Wired()) {
                
                // Reset host mode state
                _HostModeEnabled = false;
                // Clear charge status
                _ChargeStatus = MSP::ChargeStatus::Invalid;
            }
        }
    }
    
    static void WiredChanged() {
        // If we became unwired, restart our I2C state machine
        if (!_WiredMonitor::Wired()) _I2C::Abort();
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        
        MSP::Resp resp = { .ok = false };
        
        switch (cmd.op) {
        default: break;
        
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(::_State)) break;
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            resp.ok = true;
            memcpy(resp.arg.StateRead.data, (uint8_t*)&::_State+off, len);
            break;
        }
        
        case Cmd::Op::StateWrite: {
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeEnabled) break;
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(::_State)) break;
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&::_State+off, cmd.arg.StateWrite.data, len);
            resp.ok = true;
            break;
        }
        
        case Cmd::Op::BatteryStatusGet: {
            _TaskPower::BatteryLevelUpdate();
            _TaskPower::BatteryLevelWait();
            resp = MSP::Resp{
                .ok = true,
                .arg = {
                    .BatteryStatusGet = {
                        .chargeStatus = _ChargeStatus,
                        .level = _TaskPower::BatteryLevelGet(),
                    },
                },
            };
            break;
        }
        
