toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    SchedulerStack(".stack._TaskImg")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskEvent

struct _TaskEvent {
    static void Start() {
        _Scheduler::Start<_TaskEvent>();
    }
    
    static void Reset() {
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Reset();
        _TaskImg::Reset();
        // Stop tasks
        _Scheduler::Stop<_TaskSD, _TaskImg, _TaskEvent>();
        // Reset our timer (do this after we stop _TaskEvent to guarantee that
        // _TaskEvent didn't start it again after we stopped it)
        _EventTimer::Schedule(std::nullopt);
        // Turn off power
        _TaskPower::VDDIMGSDEnabled(false);
        _TaskPower::VDDBEnabled(false);
        // Reset our state
        // We do this last so that our power assertions are reset last
        _State = {};
    }
    
    static bool ISRRTC() {
        return _EventTimer::ISRRTC();
    }
    
    static bool ISRTimer(uint16_t iv) {
        return _EventTimer::ISRTimer(iv);
    }
    
    static void _TimeTrigger(_Triggers::TimeTriggerEvent& ev) {
        _Triggers::TimeTrigger& trigger = ev.trigger();
        // Schedule the CaptureImageEvent, but only if we're not in fast-forward mode
        if (_State.live) CaptureStart(trigger, ev.time);
        // Reschedule TimeTriggerEvent for its next trigger time
        EventInsert(ev);
    }
    
    static void _MotionEnablePower(_Triggers::MotionEnablePowerEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Enable motion power
        trigger.enablePower();
    }
    
    static void _MotionEnable(_Triggers::MotionEnableEvent& ev) {
        _Triggers::MotionTrigger& trigger = ev.trigger();
        
        // Enable motion power / motion
        trigger.enable();
        
        // Schedule the MotionDisableEvent, if applicable.
        // This needs to happen before we reschedule `ev` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationTicks = trigger.base().durationTicks;
        if (durationTicks) {
            EventInsert(_Cast<_Triggers::MotionDisableEvent&>(trigger), _TimeInstantAdd(ev.time, durationTicks));
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        const bool repeat = EventInsert(ev);
        
        // Schedule MotionEnablePowerEvent event `PowerOnDelayMs` before the MotionEnableEvent.
        if (repeat) {
            EventInsert(_Cast<_Triggers::MotionEnablePowerEvent>(trigger),
                _TimeInstantAdd(ev.time, -_TicksForMs(_Motion::PowerOnDelayMs)));
        }
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Disable motion power / motion
        trigger.disable();
    }
    
    static void _MotionUnsuppressPower(_Triggers::MotionUnsuppressPowerEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Unsuppress motion power
        trigger.unsuppressPower();
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Unsuppress motion
        trigger.unsuppressMotion();
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(_State.live);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        // Notify _TaskPower that we're performing a capture, and wait for it to sample the battery if it decided to.
        // We do this here because we want the battery sampling to complete before we turn on VDDB / VDDIMGSD and start
        // capturing an image, so that we sample the voltage while the system is quiet, instead of when the system is
        // bursting with activity, which causes lots of noise on the battery line.
        _TaskPower::CaptureNotify();
        
        if (ev.capture->ledFlash) {
            _TaskLED::Flash();
        }
        
        // Turn on VDD_B power (turns on ICE40)
        _TaskPower::VDDBEnabled(true);
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms<30>);
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _TaskPower::VDDIMGSDEnabled(true);
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait until _TaskSD has initialized _State.sd (since we're about to refer to
            // _State.sd.imgRingBufs), and for any previous writing to be complete (because
            // the SDRAM is single-port, so we can't write an image to RAM until we're done
            // copying an image from RAM -> SD card).
            _Scheduler::Wait([] { return _TaskSD::SDStateReady() && !_TaskSD::Writing(); });
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
             
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
        _TaskPower::VDDIMGSDEnabled(false);
        _TaskPower::VDDBEnabled(false);
        
        ev.countRem--;
        if (ev.countRem) {
            EventInsert(ev, _TimeInstantAdd(ev.time, ev.capture->delayTicks));
        }
    }
    
    static void _DST(_Triggers::DSTEvent& ev) {
        // Re-insert the DSTEvent before adjusting all subsequent events' times,
        // because we need to adjust the DSTEvent's time too.
        EventInsert(ev);
        
        const Time::TicksS32 adj = ev.base().adjustmentTicks;
        _Triggers::Event* x = _Triggers::EventBegin();
        while (x != _Triggers::EventEnd()) {
            x->time = _TimeInstantAdd(x->time, adj);
            x = x->next;
        }
    }
    
    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time) {
        _Triggers::EventInsert(ev, time);
        if (&ev == _Triggers::EventBegin()) {
            // The new event is the first event, so interrupt Run() so that it re-schedules _EventTimer.
            _EventTimer::Schedule(0);
        }
    }
    
    static bool EventInsert(_Triggers::RepeatEvent& ev) {
        const Time::TicksU32 delta = _Triggers::RepeatAdvance(ev.repeat);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
            EventInsert(ev, _TimeInstantAdd(ev.time, delta));
            return true;
        }
        return false;
    }
    
    static void EventInsert(_Triggers::DSTEvent& ev) {
        const Time::TicksU32 delta = _Triggers::DSTPhaseAdvance(ev.phase);
        EventInsert(ev, _TimeInstantAdd(ev.time, delta));
    }
    
