toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static bool CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Bail if the CaptureImageEvent is already underway
        if (ev.countRem) return false;
        
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
        return true;
    }
    
    static void _EventHandle(_Triggers::Event& ev) {
        // Handle the event
        using T = _Triggers::Event::Type;
        switch (ev.type) {
        case T::TimeTrigger:
            _TimeTrigger(           _Cast<_Triggers::TimeTriggerEvent&>(ev)             ); break;
        case T::MotionEnablePower:
            _MotionEnablePower(     _Cast<_Triggers::MotionEnablePowerEvent&>(ev)       ); break;
        case T::MotionEnable:
            _MotionEnable(          _Cast<_Triggers::MotionEnableEvent&>(ev)            ); break;
        case T::MotionDisable:
            _MotionDisable(         _Cast<_Triggers::MotionDisableEvent&>(ev)           ); break;
        case T::MotionUnsuppressPower:
            _MotionUnsuppressPower( _Cast<_Triggers::MotionUnsuppressPowerEvent&>(ev)   ); break;
        case T::MotionUnsuppress:
            _MotionUnsuppress(      _Cast<_Triggers::MotionUnsuppressEvent&>(ev)        ); break;
        case T::CaptureImage:
            _CaptureImage(          _Cast<_Triggers::CaptureImageEvent&>(ev)            ); break;
        case T::DST:
            _DST(                   _Cast<_Triggers::DSTEvent&>(ev)                     ); break;
        }
    }
    
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        const Time::Instant startTime = _RTC::Now();
        _Triggers::Init(startTime);
        
        // Fast-forward through events
        for (;;) {
            _Triggers::Event* ev = _Triggers::EventBegin();
            if (ev==_Triggers::EventEnd() || (ev->time > startTime)) break;
            _EventHandle(_Triggers::EventPop());
        }
        
        _State.live = true;
        
        // Handle events
        for (;;) {
            // Wait until we have an event
            _Scheduler::Wait([] { return _Triggers::EventBegin() != _Triggers::EventEnd(); });
            _Triggers::Event*const ev = _Triggers::EventBegin();
            
            // Schedule _EventTimer for `ev`
            _EventTimer::Schedule(ev->time);
            // Wait for _EventTimer to fire
            const bool waited = _EventTimer::Wait();
            if (!waited) continue;
            
            // Handle the event
            _EventHandle(_Triggers::EventPop());
        }
    }
    
    // _EventTimer: timer that triggers us to wake when the next event is ready to be handled
    using _EventTimer = T_Timer<_Scheduler, _RTC, _ACLKFreqHz>;
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        // live=false while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // live=true once we're done initializing and executing events normally.
        bool live = false;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskEvent")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskButton

struct _TaskButton {
    static bool _ButtonInteractionAllowed() {
        // Allow button interaction if we're not in battery trap, or we're wired
        return !_TaskPower::BatteryTrap() || _TaskPower::Wired();
    }
    
    static void _ButtonHoldPrepare() {
        _TaskLED::Set(_TaskLED::PriorityButton, _LED::StateOff);
    }
    
    static void _ButtonHold() {
        _TaskPower::On(!_TaskPower::On());
        _TaskLED::Set(_TaskLED::PriorityButton, _TaskPower::On() ? _LED::StateGreen : _LED::StateRed);
    }
    
    static void _ButtonHoldCleanup() {
        _TaskLED::Set(_TaskLED::PriorityButton, _LED::StateOff);
        _Scheduler::Sleep(_Scheduler::Ms<1000>);
        _TaskLED::Set(_TaskLED::PriorityButton, std::nullopt);
    }
    
    static void _ButtonPress() {
        // Ignore button presses if events are disabled
        if (!_EventsEnabled) return;
        
        for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
            _TaskEvent::CaptureStart(*it, _RTC::Now());
        }
    }
    
    static void Run() {
        // Disable interrupts because _Button requires it
        Toastbox::IntState ints(false);
        
        // Wait until button is released
        {
            _Button::ConfigUp();
            _Button::Wait();
        }
        
        for (;;) {
            // Wait until button is pressed
            {
                _Button::ConfigDown();
                _Button::Wait();
            }
            
            // Ignore button interaction if necessary
            if (!_ButtonInteractionAllowed()) continue;
            
            // Wait until button is released
            {
                _Button::ConfigUp();
                const bool up = _Button::Wait(_HoldShortDuration);
                if (up) {
                    _ButtonPress();
                    continue;
                }
            }
            
            // Wait until button is released
            {
                _ButtonHoldPrepare();
                const bool up = _Button::Wait(_HoldLongDuration);
                if (up) {
                    _ButtonPress();
                } else {
                    _ButtonHold();
                    // Wait until button is actually released
                    _Button::Wait();
                }
                _ButtonHoldCleanup();
            }
        }
    }
    
    static constexpr auto _HoldShortDuration = _Scheduler::Ms<300>;
    static constexpr auto _HoldLongDuration = _Scheduler::Ms<1100>;
    
    // Task stack
    SchedulerStack(".stack._TaskButton")
    static inline uint8_t Stack[128];
};

// MARK: - _TaskMotion

struct _TaskMotion {
    // _TaskMotion::Run() is a good size to put in the 'Information FRAM' section (a 512 byte section)
    // to free up some space for the regular FRAM section.
    [[gnu::section(".fram_info"), gnu::used]]
    static void Run() {
        // Disable interrupts because _Motion requires it
        Toastbox::IntState ints(false);
        
