toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        for (;;) {
            // Wait for motion to be powered
            _Scheduler::Wait([] { return _Power; });
            
            // Power on motion sensor and wait for it to start up
            _Motion::Power(true);
            
            for (;;) {
                // Wait for motion, or for motion to be disabled
                _Motion::SignalReset();
                _Scheduler::Wait([] { return !_Power || _Motion::Signal(); });
                
                // When potentially disabling the motion sensor, institute a debounce to filter 1->0->1 glitches.
                // This is so we don't have to pay for the full motion-sensor power-on time (30s) for a momentary
                // glitch.
                // Such glitches can occur when we go from wired->unwired, since we power on the motion sensor
                // when we're wired. (We do this in case the device is reconfigured to enable the motion sensor,
                // so it's ready to go as soon as we're unwired, and we don't have to pay the 30s penalty.)
                if (!_Power) {
                    _Scheduler::Wait(_PowerOffDebounceDuration, [] { return _Power; });
                    if (_Power) continue;
                    else        break;
                }
                
                _HandleMotion();
            }
            
            // Turn off motion sensor
            _Motion::Power(false);
        }
    }
    
    static void Power(bool x) {
        _Power = x;
    }
    
    static void _HandleMotion() {
        // Ignore motion if events are disabled
        // This can happen if we're wired (and therefore motion is enabled),
        // but we're powered off.
        if (!_EventsEnabled) return;
        
        // When motion occurs, start captures for each enabled motion trigger
        for (auto it=_Triggers::MotionTriggerBegin(); it!=_Triggers::MotionTriggerEnd(); it++) {
            _Triggers::MotionTrigger& trigger = *it;
            
            // Check if we should ignore this trigger
            if (!trigger.enabled()) continue;
            
            // Start capture
            const Time::Instant time = _RTC::Now();
            const bool captureStarted = _TaskEvent::CaptureStart(trigger, time);
            // CaptureStart() returns false if a capture is already in progress for this trigger.
            // Short-circuit if that's the case.
            if (!captureStarted) continue;
            
            // Update the number of motion triggers remaining.
            // If this was the last trigger that we're allowed, set the `StateMaxImageCount` bit,
            // which will disable motion for this trigger until the next MotionEnableEvent.
            if (trigger.countRem) {
                trigger.countRem--;
                if (!trigger.countRem) {
                    trigger.hitMaxImageCount();
                }
            }
            
            // Suppress motion for the specified duration, if suppression is enabled
            const Time::TicksU32 suppressTicks = trigger.base().suppressTicks;
            if (suppressTicks) {
                // Suppress power/motion immediately
                trigger.suppress();
                
                // Schedule MotionUnsuppressEvent
                const Time::Instant unsuppressTime = _TimeInstantAdd(time, suppressTicks);
                _TaskEvent::EventInsert(_Cast<_Triggers::MotionUnsuppressEvent>(trigger), unsuppressTime);
                
                // Schedule MotionUnsuppressPowerEvent event `PowerOnDelayMs` before the MotionUnsuppressEvent.
                const Time::Instant prepareTime = _TimeInstantAdd(unsuppressTime, -_TicksForMs(_Motion::PowerOnDelayMs));
                _TaskEvent::EventInsert(_Cast<_Triggers::MotionUnsuppressPowerEvent>(trigger), prepareTime);
            }
        }
    }
    
    static constexpr auto _PowerOffDebounceDuration = _Scheduler::Ms<1000>;
    static inline bool _Power = false;
    
    // Task stack
    SchedulerStack(".stack._TaskMotion")
    static inline uint8_t Stack[256];
};





















// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    // Put ourself to sleep until an interrupt occurs
    
    // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
    // We do this to prevent ourself from waking up unnecessarily, saving power.
    const bool systickEnabled = _Scheduler::TickRequired();
    _SysTick::Enabled(systickEnabled);
    
    // We consider the sleep 'extended' if SysTick isn't needed during the sleep
    const bool extendedSleep = !systickEnabled;
    _Clock::Sleep(extendedSleep);
    
    // Unconditionally enable SysTick while we're awake
    _SysTick::Enabled(true);
}

// MARK: - Properties

static void _EventsEnabledUpdate() {
    _EventsEnabled = _TaskPower::On() && !_TaskI2C::HostModeEnabled();
}

static void _EventsEnabledChanged() {
    if (_EventsEnabled) _TaskEvent::Start();
    else                _TaskEvent::Reset();
}

static void _MotionPoweredUpdate() {
    _TaskMotion::Power(_TaskPower::Wired() || (_EventsEnabled && _MotionPowered::Asserted()));
}

// MARK: - Interrupts

[[gnu::interrupt]]
void _ISR_RTC() {
    // Let _EventTimer know we got an RTC interrupt
    bool wake = false;
    
    // Pet the watchdog first
    _Watchdog::Init();
    
    // Let _RTC know that we got an RTC interrupt
    _RTC::ISR(RTCIV);
    
    wake |= _TaskEvent::ISRRTC();
    wake |= _TaskPower::ISRRTC();
    
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER1_A1() {
//    _Pin::LED_GREEN_::Write(!_Pin::LED_GREEN_::Read());
    const bool wake = _SysTick::ISR(TA1IV);
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER2_A1() {
    const bool wake = _TaskEvent::ISRTimer(TA2IV);
    
//    _Pin::LED_RED_::Write(1);
//    for (;;) {
//        _Pin::LED_RED_::Write(1);
//        __delay_cycles(1000000);
//        _Pin::LED_RED_::Write(0);
//        __delay_cycles(1000000);
//    }
    
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_PORT2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (iv) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        // Wake ourself
        _Clock::Wake();
        break;
    
    // Wired (ie VDD_B_3V3_STM)
    case _WiredMonitor::Pin::IVPort2():
        _WiredMonitor::ISR(iv);
        // Notify _TaskI2C that our wired state changed
        _TaskI2C::WiredChanged();
        // Wake ourself
        _Clock::Wake();
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        // Wake ourself
        _Clock::Wake();
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt]]
void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_ADC() {
    const bool wake = _BatterySampler::ISR(ADCIV);
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[noreturn]]
[[gnu::naked]] // No function preamble because we always abort, so we don't need to preserve any registers
[[gnu::interrupt]]
void _ISR_UNMI() {
    switch (SYSUNIV) {
    case SYSUNIV_NMIIFG:    Assert(false);
    case SYSUNIV_OFIFG:     Assert(false);
    default:                Assert(false);
    }
}

[[gnu::interrupt]]
void _ISR_SYSNMI() {
    switch (SYSSNIV) {
    case SYSSNIV_VMAIFG:
        Assert(false);
    
#if DebugEnable
    // We can get spurious interrupts when reading the debug log via SBW
    // This is likely because Debug.h disables/enables JMBOUTIE to disable/enable the JMBOUTIFG interrupt.
    // Presumably there's a race between the JMBOUTIFG interrupt being scheduled and us actually reading
    // SYSSNIV, between which JMBOUTIE can be cleared, which causes SYSSNIV==0.
    case SYSSNIV_NONE:
        break;
    case SYSSNIV_JMBOUTIFG:
        if (Debug::ISR()) {
            // Wake ourself if directed
            _Clock::Wake();
        }
        break;
#endif // DebugEnable
    
    default:
        Assert(false);
    }
}

// MARK: - Main

//extern "C" void Blink() {
//    for (;;) {
//        _Pin::LED_GREEN_::Write(0);
//        for (volatile uint16_t i=0; i<50000; i++);
//        _Pin::LED_GREEN_::Write(1);
//        for (volatile uint16_t i=0; i<50000; i++);
//    }
//}

int main() {
    // If our previous reset wasn't because we explicitly reset ourself (a 'software BOR'),
    // reset ourself now.
    //
    // This ensures that any unexpected reset (such as a watchdog timer timeout) triggers
    // a full BOR, and not a PUC or a POR. We want a full BOR because it resets all our
    // peripherals, unlike a PUC/POR, which don't reset all peripherals (like timers).
    // This will cause us to reset ourself twice upon initial startup, but that's OK.
    //
    // We want to do this here before interrupts are first enabled, and not within
    // _TaskPower, to ensure that we don't have pending resets after a reset (since some
    // IFG flags persist across PUC/POR). We especially don't want our peripherals to
    // receive ISRs before they're initialized.
    //
    // We also want to do this here to prevent a potential crash loop: if an interrupt
    // handler crashed before it clears its IFG flag, and that IFG flag persists across
    // PUC/POR, if we enabled interrupts before checking if this reset was a BOR, then
    // the interrupt would immediately fire again and a crash loop would ensue. (We may
    // have encountered this issue when we had missing entries in our vector table.)
    if (Startup::ResetReason() != SYSRSTIV_DOBOR) {
        _Reset(MSP::Reset::Type::Reset, Startup::ResetReason());
    }
    
    // Invokes the first task's Run() function (_TaskPower::Run)
    _Scheduler::Run();
}
